# Data Munging

In [9]:
import pandas as pd

In [10]:
DS1=pd.read_csv('emp1.csv', index_col=0)
DS1

       Name  Age       City   Salary
SNo
1       Tom   28    Toronto  20000.0
2       Lee   32   HongKong   3000.0
3    Steven   43    BayArea   8300.0
4       Ram   38  Hyderabad   3900.0
5      Dave   34    Toronto   8000.0

In [11]:
DS1.to_html('emp1test.html')

In [12]:
DS1.to_excel('Emp1.xlsx')

In [13]:
DS2=pd.read_csv('hospital.csv',sep=';',index_col=0)
DS2

    Gender  FSIQ  VIQ  PIQ Weight  Height  MRI_Count
id
1   Female   133  132  124    118    64.5     816932
2     Male   140  150  124      .    72.5    1001121
3     Male   139  123  150    143    73.3    1038437
4     Male   133  129  128    172    68.8     965353
5   Female   137  132  134    147    65.0     951545
6   Female    99   90  110    146    69.0     928799
7   Female   138  136  131    138    64.5     991305
8   Female    92   90   98    175    66.0     854258
9     Male    89   93   84    134    66.3     904858
10    Male   133  114  147    172    68.8     955466
11  Female   132  129  124    118    64.5     833868
12    Male   141  150  128    151    70.0    1079549
13    Male   135  129  124    155    69.0     924059
14  Female   140  120  147    155    70.5     856472
15  Female    96  100   90    146    66.0     878897
16  Female    83   71   96    135    68.0     865363
17  Female   132  132  120    127    68.5     852244
18    Male   100   96  102    178    73.5     945088
19  Female   101  112   84    136    66.3     808020
20    Male    80   77   86    180    70.0     889083

In [14]:
DS2.to_html('hospital.html')

In [15]:
DS2.to_excel('hospital1.xlsx')

In [16]:
DS2.to_csv('hospital2',sep='\t')

In [17]:
DS2.to_csv('hospital3',sep=':')

In [18]:
DS2.to_csv('hospital.csv')

# PANDAS DATE TIME FUNCTION

In [138]:
df1=pd.read_csv('hrdata.csv')
df1

             Name  HireDate   Salary  SickDaysremaining
0  Graham Chapman  03/15/14  50000.0                 10
1     John Cleese  06/01/15  65000.0                  8
2       Eric Idle  05/12/14  45000.0                 10
3     Terry Jones  11/01/13  70000.0                  3
4   Terry Gilliam  08/12/14  48000.0                  7
5   Michael Palin  05/23/13  66000.0                  8

In [29]:
df1['HireDate']=pd.to_datetime(df1['HireDate'])

In [30]:
print(type(df1['HireDate'][2]))

<class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [31]:
df1

             Name   HireDate   Salary  SickDaysremaining
0  Graham Chapman 2014-03-15  50000.0                 10
1     John Cleese 2015-06-01  65000.0                  8
2       Eric Idle 2014-05-12  45000.0                 10
3     Terry Jones 2013-11-01  70000.0                  3
4   Terry Gilliam 2014-08-12  48000.0                  7
5   Michael Palin 2013-05-23  66000.0                  8

In [41]:
d=(pd.to_datetime({'year':[2022],'month':[8],'day':[17]}),
pd.to_datetime({'year':[2022],'month':[10],'day':[18]}),
pd.to_datetime({'year':[2022],'month':[12],'day':[19]}))
d

(0   2022-08-17
 dtype: datetime64[ns],
 0   2022-10-18
 dtype: datetime64[ns],
 0   2022-12-19
 dtype: datetime64[ns])

In [46]:
f=(pd.to_datetime({'year':[2020],'month':[5],'day':[12]})),(pd.to_datetime({'year':[2021],'month':[6],'day':[21]}))

In [48]:
f

(0   2020-05-12
 dtype: datetime64[ns],
 0   2021-06-21
 dtype: datetime64[ns])

In [ ]:
#pandas.date_range()

#in range function date format ----->> mm/dd/yyyy

In [53]:
daterange=pd.date_range(start='8/17/2022',end='8/31/2022',freq='D')      #same month range with frquency of Day
daterange

DatetimeIndex(['2022-08-17', '2022-08-18', '2022-08-19', '2022-08-20',
               '2022-08-21', '2022-08-22', '2022-08-23', '2022-08-24',
               '2022-08-25', '2022-08-26', '2022-08-27', '2022-08-28',
               '2022-08-29', '2022-08-30', '2022-08-31'],
              dtype='datetime64[ns]', freq='D')

In [51]:
daterange1=pd.date_range(start='8/17/2022',end='10/31/2022',freq='D')    #different month range with frquency of Day
daterange1

DatetimeIndex(['2022-08-17', '2022-08-18', '2022-08-19', '2022-08-20',
               '2022-08-21', '2022-08-22', '2022-08-23', '2022-08-24',
               '2022-08-25', '2022-08-26', '2022-08-27', '2022-08-28',
               '2022-08-29', '2022-08-30', '2022-08-31', '2022-09-01',
               '2022-09-02', '2022-09-03', '2022-09-04', '2022-09-05',
               '2022-09-06', '2022-09-07', '2022-09-08', '2022-09-09',
               '2022-09-10', '2022-09-11', '2022-09-12', '2022-09-13',
               '2022-09-14', '2022-09-15', '2022-09-16', '2022-09-17',
               '2022-09-18', '2022-09-19', '2022-09-20', '2022-09-21',
               '2022-09-22', '2022-09-23', '2022-09-24', '2022-09-25',
               '2022-09-26', '2022-09-27', '2022-09-28', '2022-09-29',
               '2022-09-30', '2022-10-01', '2022-10-02', '2022-10-03',
               '2022-10-04', '2022-10-05', '2022-10-06', '2022-10-07',
               '2022-10-08', '2022-10-09', '2022-10-10', '2022-10-11',
               '2022-10-12', '2022-10-13', '2022-10-14', '2022-10-15',
               '2022-10-16', '2022-10-17', '2022-10-18', '2022-10-19',
               '2022-10-20', '2022-10-21', '2022-10-22', '2022-10-23',
               '2022-10-24', '2022-10-25', '2022-10-26', '2022-10-27',
               '2022-10-28', '2022-10-29', '2022-10-30', '2022-10-31'],
              dtype='datetime64[ns]', freq='D')

In [77]:
drange=pd.date_range(start='5/12/2021',end='6/18/2021',freq='D')
drange

DatetimeIndex(['2021-05-12', '2021-05-13', '2021-05-14', '2021-05-15',
               '2021-05-16', '2021-05-17', '2021-05-18', '2021-05-19',
               '2021-05-20', '2021-05-21', '2021-05-22', '2021-05-23',
               '2021-05-24', '2021-05-25', '2021-05-26', '2021-05-27',
               '2021-05-28', '2021-05-29', '2021-05-30', '2021-05-31',
               '2021-06-01', '2021-06-02', '2021-06-03', '2021-06-04',
               '2021-06-05', '2021-06-06', '2021-06-07', '2021-06-08',
               '2021-06-09', '2021-06-10', '2021-06-11', '2021-06-12',
               '2021-06-13', '2021-06-14', '2021-06-15', '2021-06-16',
               '2021-06-17', '2021-06-18'],
              dtype='datetime64[ns]', freq='D')

In [73]:
daterange2=pd.date_range(start='4/17/2021',end='10/31/2022',freq='M')    #different month range with frquency of Month(M)
daterange2

DatetimeIndex(['2021-04-30', '2021-05-31', '2021-06-30', '2021-07-31',
               '2021-08-31', '2021-09-30', '2021-10-31', '2021-11-30',
               '2021-12-31', '2022-01-31', '2022-02-28', '2022-03-31',
               '2022-04-30', '2022-05-31', '2022-06-30', '2022-07-31',
               '2022-08-31', '2022-09-30', '2022-10-31'],
              dtype='datetime64[ns]', freq='M')

In [75]:
daterange3=pd.date_range(start='4/17/2021',end='10/21/2022',freq='M') #incase end date is not the last day of the month in that case the range fn will show the previous month last date
daterange3

DatetimeIndex(['2021-04-30', '2021-05-31', '2021-06-30', '2021-07-31',
               '2021-08-31', '2021-09-30', '2021-10-31', '2021-11-30',
               '2021-12-31', '2022-01-31', '2022-02-28', '2022-03-31',
               '2022-04-30', '2022-05-31', '2022-06-30', '2022-07-31',
               '2022-08-31', '2022-09-30'],
              dtype='datetime64[ns]', freq='M')

In [139]:
import datetime

dt=datetime.datetime.now()       #current date time
print(dt)

2022-08-18 00:07:07.916375

In [141]:
#to_timedelta --->> Represent duration , the difference between two dates & times.


print(dt+pd.to_timedelta(10,unit='D'))

2022-08-28 00:07:07.916375

In [121]:
dt1=datetime.datetime.now()
print (dt1)

2022-08-17 23:49:40.440432

In [124]:
print(dt1+pd.to_timedelta(15,unit='D'))

2022-09-01 23:49:40.440432

In [136]:
df1['day']=df1['HireDate'].dt.day
df1['month']=df1['HireDate'].dt.month
df1['year']=df1['HireDate'].dt.year

In [137]:
df1

             Name   HireDate   Salary  SickDaysremaining  day  month  year
0  Graham Chapman 2014-03-15  50000.0                 10   15      3  2014
1     John Cleese 2015-06-01  65000.0                  8    1      6  2015
2       Eric Idle 2014-05-12  45000.0                 10   12      5  2014
3     Terry Jones 2013-11-01  70000.0                  3    1     11  2013
4   Terry Gilliam 2014-08-12  48000.0                  7   12      8  2014
5   Michael Palin 2013-05-23  66000.0                  8   23      5  2013